digistump/OakCore/cores/esp8266/OakParticle/particle_core.cpp
    if (sent>0) {
        //serial_dump("Sent %d missing chunks", sent);

        size_t message_size = 7+(sent*2);
        message_size = wrap(queue, message_size);
        if (0 > blocking_send(queue, message_size))
            return -1;
    }
    return sent;
}

void chunk_missed(unsigned char *buf, unsigned short chunk_index)
{
  unsigned short message_id = next_message_id();

  buf[0] = 0x40; // confirmable, no token
  buf[1] = 0x01; // code 0.01 GET
  buf[2] = message_id >> 8;
  buf[3] = message_id & 0xff;
  buf[4] = 0xb1; // one-byte Uri-Path option
  buf[5] = 'c';
  buf[6] = 0xff; // payload marker
  buf[7] = chunk_index >> 8;
  buf[8] = chunk_index & 0xff;

  memset(buf + 9, 7, 7); // PKCS #7 padding

  encrypt(buf, 16);
}

void update_ready(unsigned char *buf, unsigned char token)
{
    separate_response_with_payload(buf, token, 0x44, NULL, 0);
}

void update_ready(unsigned char *buf, unsigned char token, uint8_t flags)
{
    separate_response_with_payload(buf, token, 0x44, &flags, 1);
}



static uint8 calc_boot_chksum(uint8 *start, uint8 *end) {
    uint8 chksum = CHKSUM_INIT;
    while(start < end) {
        chksum ^= *start;
        start++;
    }
    return chksum;
}


bool readBootConfig(){
    noInterrupts();
    spi_flash_read(BOOT_CONFIG_SECTOR * SECTOR_SIZE, reinterpret_cast<uint32_t*>(boot_buffer), BOOT_CONFIG_SIZE);
    
    if(bootConfig->magic != BOOT_CONFIG_MAGIC || bootConfig->chksum != calc_boot_chksum((uint8*)bootConfig, (uint8*)&bootConfig->chksum)){
        
        //load the backup and copy to main
        spi_flash_read(BOOT_BACKUP_CONFIG_SECTOR * SECTOR_SIZE, reinterpret_cast<uint32_t*>(boot_buffer), BOOT_CONFIG_SIZE);
        spi_flash_erase_sector(BOOT_CONFIG_SECTOR);
        spi_flash_write(BOOT_CONFIG_SECTOR * SECTOR_SIZE, reinterpret_cast<uint32_t*>(boot_buffer), BOOT_CONFIG_SIZE);
        
    }
    interrupts();
    
    if(bootConfig->magic != BOOT_CONFIG_MAGIC || bootConfig->chksum != calc_boot_chksum((uint8*)bootConfig, (uint8*)&bootConfig->chksum)){
        return false;
    }
    
    return true;
}

void writeBootConfig(){
    noInterrupts();
    bootConfig->chksum = calc_boot_chksum((uint8*)bootConfig,(uint8*)&bootConfig->chksum);
    spi_flash_erase_sector(BOOT_CONFIG_SECTOR);
    spi_flash_write(BOOT_CONFIG_SECTOR * SECTOR_SIZE, reinterpret_cast<uint32_t*>(boot_buffer), BOOT_CONFIG_SIZE);
    spi_flash_erase_sector(BOOT_BACKUP_CONFIG_SECTOR);
    spi_flash_write(BOOT_BACKUP_CONFIG_SECTOR * SECTOR_SIZE, reinterpret_cast<uint32_t*>(boot_buffer), BOOT_CONFIG_SIZE);
    interrupts();
    
}




#define FLASH_MAX_SIZE          (unsigned long)(0x100000 - 0x2000)
#define OTA_CHUNK_SIZE          (unsigned long)512

uint32_t getOTAFlashSlot(){
    if(bootConfig->program_rom != 0 && bootConfig->config_rom != 0)
      return 0;
    else if(bootConfig->program_rom != 4 && bootConfig->config_rom != 4)
      return 4;
    else
      return 8;
}

bool status_led_state = false;
#define STATUS_LED 5
void LED_Toggle(){
  status_led_state = !status_led_state;
  digitalWrite(STATUS_LED, status_led_state);
}

int prepare_for_firmware_update(FileTransfer::Descriptor& file, uint32_t flags, void* reserved)
{
    Serial.println("FIRMWARE");
    file.file_address = bootConfig->roms[getOTAFlashSlot()];// + file.chunk_address;

    // chunk_size 0 indicates defaults.
    if (file.chunk_size==0) {
        file.chunk_size = OTA_CHUNK_SIZE;
        file.file_length = FLASH_MAX_SIZE;
    }

    int result = 0;
    if (flags & 1) {
        // only check address
    }
    else {
        pinMode(STATUS_LED, OUTPUT);
        if (file.store!=FileTransfer::Store::FIRMWARE)
          return 1;
    }
    return result;
}

void set_chunks_received(uint8_t value)
{
    size_t bytes = chunk_bitmap_size();
    if (bytes)
      memset(queue+QUEUE_SIZE-bytes, value, bytes);
}

uint16_t last_chunk = 0;

void spark_process();

bool handle_update_begin(msg& message)
{
    // send ACK
    uint8_t* msg_to_send = message.response;
    *msg_to_send = 0;
    *(msg_to_send + 1) = 16;

    uint8_t flags = 0;
    int actual_len = message.len - queue[message.len-1];
    if (actual_len>=20 && queue[7]==0xFF) {
        flags = decode_uint8(queue+8);
        file.chunk_size = decode_uint16(queue+9);
        file.file_length = decode_uint32(queue+11);
        file.store = FileTransfer::Store::Enum(decode_uint8(queue+15));
        file.file_address = decode_uint32(queue+16);
        file.chunk_address = file.file_address;
    }
    else {
        file.chunk_size = 0;
        file.file_length = 0;
        file.store = FileTransfer::Store::FIRMWARE;
        file.file_address = 0;
        file.chunk_address = 0;
    }

    

    // check the parameters only
    bool success = !prepare_for_firmware_update(file, 1, NULL);
    if (success) {
        success = file.chunk_count(file.chunk_size) < MAX_CHUNKS;
    }

    last_chunk = file.chunk_count(OTA_CHUNK_SIZE)-1;

    coded_ack(msg_to_send+2, success ? 0x00 : RESPONSE_CODE(4,00), queue[2], queue[3]);
    if (0 > blocking_send(msg_to_send, 18))
    {
      // error
      return false;
    }
    if (success)
    {
        if (!prepare_for_firmware_update(file, 0, NULL))
        {
            last_chunk_millis = millis();
            chunk_index = 0;
            chunk_size = file.chunk_size;   // save chunk size since the descriptor size is overwritten
            updating = 1;
            // when not in fast OTA mode, the chunk missing buffer is set to 1 since the protocol
            // handles missing chunks one by one. Also we don't know the actual size of the file to
            // know the correct size of the bitmap.
            set_chunks_received(flags & 1 ? 0 : 0xFF);
            // send update_reaady - use fast OTA if available
            update_ready(msg_to_send + 2, message.token, (flags & 0x1));
            if (0 > blocking_send(msg_to_send, 18))
            {
              // error
              return false;
            }
        }
    }

    //PUMP ONLY CLOUD WHIE UPDATING
    uint32_t update_timeout = millis()+60000;
    while(updating>0 && millis()<update_timeout){
      spark_process();
    }
    return true;
}

void spark_disconnect(){
  if(pClient.connected())
    pClient.stop();
}

int finish_firmware_update(FileTransfer::Descriptor& file, uint32_t flags, void* reserved)
{

    Serial.println("UPDATE FINISHED - REBOOT ME");
    if (flags & 1) {    // update successful

        if((file.chunk_address/SECTOR_SIZE)<((file.file_address+FLASH_MAX_SIZE)/SECTOR_SIZE)-1){ 
        //check if sector of final chunk is less then the max sector
          noInterrupts();
          spi_flash_erase_sector((file.chunk_address/SECTOR_SIZE)+1);
          interrupts();
        }

        //TODO check CRC and fall through if it fails

        Serial.println("DONE - RESTART");
        //TODO bootConfig->current_rom = getOTAFlashSlot();
        spark_disconnect();
        delay(100);
        ESP.restart();
        while(1);
        
