digistump/OakCore/cores/esp8266/OakParticle/particle_core.cpp
      //callbacks.signal(false, 0, NULL);
      break;

    case CoAPMessageType::HELLO:
      if(deviceConfig->ota_success == 1){
        deviceConfig->ota_success = 0;
        writeDeviceConfig();
      }
      break;

    case CoAPMessageType::TIME:
      handle_time_response(queue[6] << 24 | queue[7] << 16 | queue[8] << 8 | queue[9]);
      break;

    case CoAPMessageType::PING:
      queue[0] = 0;
      queue[1] = 16;
      empty_ack(queue + 2, queue[2], queue[3]);
      if (0 > blocking_send(queue, 18))
      {
        // error
        return false;
      }
      break;

    case CoAPMessageType::EMPTY_ACK:
    case CoAPMessageType::ERROR:
    default:
      ; // drop it on the floor
  }

  // all's well
  return true;
}

CoAPMessageType::Enum received_message(unsigned char *buf, size_t length)
{
  unsigned char next_iv[16];
  memcpy(next_iv, buf, 16);

  aes_setkey_dec(&aes, key, 128);
  aes_crypt_cbc(&aes, AES_DECRYPT, length, iv_receive, buf, buf);

  memcpy(iv_receive, next_iv, 16);

  return Messages::decodeType(buf, length);
}



CoAPMessageType::Enum handle_received_message(void)
{
  last_message_millis = millis();
  expecting_ping_ack = false;
  size_t len = queue[0] << 8 | queue[1];
  if (len > QUEUE_SIZE) { // TODO add sanity check on data, e.g. CRC
      return CoAPMessageType::ERROR;
  }
  if (0 > blocking_receive(queue, len))
  {
    // error
    return CoAPMessageType::ERROR;;
  }
  CoAPMessageType::Enum message_type = received_message(queue, len);

  unsigned char token = queue[4];
  unsigned char *msg_to_send = queue + len;

  msg message;
  message.len = len;
  message.token = queue[4];
  message.response = msg_to_send;
  message.response_len = QUEUE_SIZE-len;

  return handle_message(message, token, message_type)
          ? message_type : CoAPMessageType::ERROR;
}


// Returns true if no errors and still connected.
// Returns false if there was an error, and we are probably disconnected.
bool event_loop(CoAPMessageType::Enum& message_type)
{
    message_type = CoAPMessageType::NONE;
  int bytes_received = receive(queue, 2);
  if (2 <= bytes_received)
  {
    message_type = handle_received_message();
    if (message_type==CoAPMessageType::ERROR)
    {
        if (updating) {      // was updating but had an error, inform the client
            finish_firmware_update(file, 0, NULL);
            updating = false;
        }

      // bail if and only if there was an error
      return false;
    }
  }
  else
  {
    if (0 > bytes_received)
    {
      // error, disconnected
      return false;
    }

    if (updating)
    {
      uint32_t millis_since_last_chunk = millis() - last_chunk_millis;
      if (3000 < millis_since_last_chunk)
      {
          if (updating==2) {    // send missing chunks
              //serial_dump("timeout - resending missing chunks");
              if (!send_missing_chunks(MISSED_CHUNKS_TO_SEND))
                  return false;
          }
          /* Do not resend chunks since this can cause duplicates on the server.
          else
          {
            queue[0] = 0;
            queue[1] = 16;
            chunk_missed(queue + 2, chunk_index);
            if (0 > blocking_send(queue, 18))
            {
              // error
              return false;
            }
          }
          */
          last_chunk_millis = millis();
      }
    }
    else
    {
      uint32_t millis_since_last_message = millis() - last_message_millis;
      if (expecting_ping_ack)
      {
        if (10000 < millis_since_last_message)
        {
          // timed out, disconnect
          expecting_ping_ack = false;
          last_message_millis = millis();
          ERROR("FAILED4");
          return false;
        }
      }
      else
      {
        if (15000 < millis_since_last_message)
        {
          queue[0] = 0;
          queue[1] = 16;
          ping(queue + 2);
          blocking_send(queue, 18);

          expecting_ping_ack = true;
          last_message_millis = millis();
        }
      }
    }
  }

  // no errors, still connected
  //ERROR("DID NOT FAIL");
  return true;
}

bool event_loop(CoAPMessageType::Enum message_type, uint32_t timeout)
{
    uint32_t start = millis();
    do
    {
        CoAPMessageType::Enum msgtype;
        if (!event_loop(msgtype))
            return false;
        if (msgtype==message_type)
            return true;
        // todo - ideally need a delay here
    }
    while ((millis()-start) < timeout);
    return false;
}


bool event_loop()
  {
    CoAPMessageType::Enum message;
    return event_loop(message);
  }


int handshake(){
  pClient.setNoDelay(false);
  Serial.println(pClient.status());
	memcpy(queue + 40, device_id, 12);
	int err = blocking_receive(queue, 40);;
  Serial.println(err);
	if (0 > err) { ERROR("Handshake: could not receive nonce");  return err; }

	memcpy(queue+52, deviceConfig->device_public_key,PUBLIC_KEY_LENGTH);

	rsa_context rsa;
	init_rsa_context_with_public_key(&rsa, deviceConfig->server_public_key);
	const int len = 52+PUBLIC_KEY_LENGTH;
	err = rsa_pkcs1_encrypt(&rsa, RSA_PUBLIC, len, queue, queue + len);
	rsa_free(&rsa);

	if (err) { ERROR("Handshake: rsa encrypt error"); return err; }

  Serial.println(pClient.status());

	err = blocking_send(queue + len, 256);
  if (0 > err) { Serial.println(pClient.status()); ERROR("Handshake: Unable to send key"); return err; }
	err = blocking_receive(queue, 384);
	if (0 > err) { ERROR("Handshake: Unable to receive key"); return err; }

	err = set_key(queue);
	if (err) { ERROR("Handshake:  could not set key"); return err; }

	//gets reset on response in handle message
	hello(queue, deviceConfig->ota_success);

	err = blocking_send(queue, 18);
	if (0 > err) { ERROR("Hanshake: could not send hello message"); return err; }

	if (!event_loop(CoAPMessageType::HELLO, 2000))        // read the hello message from the server
	{
	  ERROR("Handshake: could not receive hello response");
	  return -1;
	}
	INFO("Hanshake: completed");
	return 0;
}






void remove_event_handlers(const char* event_name)
{
    if (NULL == event_name)
    {
        memset(event_handlers, 0, sizeof(event_handlers));
    }
    else
    {
        const int NUM_HANDLERS = sizeof(event_handlers) / sizeof(FilteringEventHandler);
        int dest = 0;
        for (int i = 0; i < NUM_HANDLERS; i++)
        {
          if (!strcmp(event_name, event_handlers[i].filter))
          {
              memset(&event_handlers[i], 0, sizeof(event_handlers[i]));
          }
          else
          {
              if (dest!=i) {
                memcpy(event_handlers+dest, event_handlers+i, sizeof(event_handlers[i]));
                memset(event_handlers+i, 0, sizeof(event_handlers[i]));
              }
              dest++;
          }
        }
    }
}




bool particleConnect(){
	if(deviceConfig->server_address_type == 1){
		//return client.connect(deviceConfig->server_address_domain,SPARK_SERVER_PORT);
    return pClient.connect("staging-device.spark.io",SPARK_SERVER_PORT);
		//return pClient.connect(IPAddress(192,168,0,111),SPARK_SERVER_PORT);
	}
	else{
		return pClient.connect(IPAddress(deviceConfig->server_address_ip),SPARK_SERVER_PORT);	
	}
}


//this connects to the configured wifi
bool wifiConnect(){
  WiFi.softAPdisconnect(false);
  WiFi.mode(WIFI_STA);
  if(deviceConfig->passcode[0] != '\0' && deviceConfig->channel > 0){
    WiFi.begin(deviceConfig->ssid,deviceConfig->passcode, deviceConfig->channel);
  }
  else if(deviceConfig->passcode[0] != '\0'){
    WiFi.begin(deviceConfig->ssid,deviceConfig->passcode);
  }
  else if(deviceConfig->channel > 0){
    WiFi.begin(deviceConfig->ssid, NULL, deviceConfig->channel);
  }
  else if (deviceConfig->ssid[0] != '\0'){
    WiFi.begin(deviceConfig->ssid);
  }
  else{
  	return false;
  }
  return true;
}

bool wifiConnected(){
  return (WiFi.status() == WL_CONNECTED);
}





bool wifiWaitForConnection(){ //returns false if it times out - I will later add code to jump to config rom in this case
  uint32_t timeoutTime = millis() + 15000;
  while (WiFi.status() != WL_CONNECTED)
  {
    yield();
    //timeout after 15 seconds
    if(millis() > timeoutTime){
        return false;
      }
      delay(100);
  }
  return true;
}




bool readDeviceConfig(){
	noInterrupts();
	spi_flash_read(DEVICE_CONFIG_SECTOR * SECTOR_SIZE, reinterpret_cast<uint32_t*>(config_buffer), DEVICE_CONFIG_SIZE);

	if(deviceConfig->magic != DEVICE_MAGIC || deviceConfig->chksum != calc_device_chksum((uint8*)deviceConfig, (uint8*)&deviceConfig->chksum)){
	//load the backup and copy to main
	spi_flash_read(DEVICE_BACKUP_CONFIG_SECTOR * SECTOR_SIZE, reinterpret_cast<uint32_t*>(config_buffer), DEVICE_CONFIG_SIZE);
	spi_flash_erase_sector(DEVICE_CONFIG_SECTOR);
	spi_flash_write(DEVICE_CONFIG_SECTOR * SECTOR_SIZE, reinterpret_cast<uint32_t*>(config_buffer), DEVICE_CONFIG_SIZE);
	}
	interrupts();

	if(deviceConfig->magic != DEVICE_MAGIC || deviceConfig->chksum != calc_device_chksum((uint8*)deviceConfig, (uint8*)&deviceConfig->chksum)){
	    //TODO: reboot to config rom
	    while(1);
	    return false;
	}

