digistump/OakCore/cores/esp8266/OakParticle/particle_core.cpp
	return true;
}









unsigned char next_token()
{
  return ++_token;
}

size_t time_request(unsigned char *buf)
{
    uint16_t msg_id = next_message_id();
    uint8_t token = next_token();
    return Messages::time_request(buf, msg_id, token);
}


bool send_time_request(void)
{
  if (updating)
  {
    return false;
  }

  size_t msglen = time_request(queue + 2);
  size_t wrapped_len = wrap(queue, msglen);
  last_chunk_millis = millis();

  return (0 <= blocking_send(queue, wrapped_len));
}

bool particle_handshake(){

  char buf[65];

  if(handshake()<0)
    return false;

  INFO("SEND EVENTS");
  if(deviceConfig->claim_code[0] != '\0')
    spark_send_event("spark/device/claim/code", buf, 60, PRIVATE, NULL);

  //send max size of rom
  ultoa(FLASH_MAX_SIZE, buf, 10);
  spark_send_event("spark/hardware/max_binary", buf, 60, PRIVATE, NULL);

  //send ota chunk size
  ultoa(OTA_CHUNK_SIZE, buf, 10);
  spark_send_event("spark/hardware/ota_chunk_size", buf, 60, PRIVATE, NULL);

  ///if we want to be able to get a system update we need to send that we are in safe more right now
  if (deviceConfig->system_version < OAK_SYSTEM_VERSION && bootConfig->current_rom != bootConfig->config_rom)
    spark_send_event("spark/device/safemode" "", "", 60, PRIVATE, NULL);

  #if defined(SPARK_SUBSYSTEM_EVENT_NAME)
    if (!HAL_core_subsystem_version(buf, sizeof (buf)) && *buf)
    {
        spark_send_event("spark/" SPARK_SUBSYSTEM_EVENT_NAME, buf, 60, PRIVATE, NULL);
    }
  #endif

  INFO("SEND SUBS");

  send_subscriptions();
  // important this comes at the end since it requires a response from the cloud.
  INFO("SEND TIME REQ");
  send_time_request();
  INFO("LOOP");
  event_loop();
  return true;
}




void rebootToUser(){
  bootConfig->current_rom = bootConfig->program_rom;
  ESP.restart();
  while(1);
}

void rebootToConfig(){
  bootConfig->current_rom = bootConfig->config_rom;
  ESP.restart();
  while(1);
}

String spark_deviceID(){
  return String(deviceConfig->device_id);
}

const char* CLAIM_EVENTS = "spark/device/claim/";
const char* RESET_EVENT = "spark/device/reset";
const char* OAK_RESET_EVENT = "oak/device/reset";
const char* OAK_RX_EVENT = "oak/device/stdin";

void SystemEvents(const char* name, const char* data)
{
    if (!strncmp(name, CLAIM_EVENTS, strlen(CLAIM_EVENTS))) {
        //mark as claimed
        deviceConfig->claim_code[0] != '\0';
        deviceConfig->claimed = 1;
        writeDeviceConfig();
    }
    if (!strcmp(name, RESET_EVENT)) {
        if (data && *data) {
            if (!strcmp("safe mode", data))
              return;
                //TODO System.enterSafeMode();
            else if (!strcmp("dfu", data))
              return;
                //TODO System.dfu(false);
            else if (!strcmp("reboot", data))
                ESP.reset();
        }
    }
    if (!strcmp(name, OAK_RESET_EVENT)) {
        if (data && *data) {
            if (!strcmp("config mode", data))
                rebootToConfig();
            else if (!strcmp("user mode", data))
                rebootToUser();
            else if (!strcmp("reboot", data))
                ESP.reset();
        }
    }
    if (!strcmp(name, OAK_RX_EVENT)) {
        if (data && *data) {
            /*
            while(*data != '\0'){
              // if buffer full, set the overflow flag and return
              uint8_t next = (spark_receive_buffer_tail + 1) % MAX_BUFF;
              if (next != spark_receive_buffer_head)
              {
                // save new data in buffer: tail points to where byte goes
                spark_receive_buffer[spark_receive_buffer_tail] = *data; // save new byte
                data++;
                spark_receive_buffer_tail = next;
              } 
              else 
              {
                spark_buffer_overflow = true;
                return;
              }
            }
             */
        }
    }
}


#define OAK_SYSTEM_ROM_4F616B 82

void oak_rom_init(){
  #ifndef OAK_SYSTEM_ROM_4F616B
    #define OAK_SYSTEM_ROM_4F616B 0
  #endif
  #ifdef OAK_SYSTEM_ROM_4F616B //DO NOT DEFINE THIS IN YOUR FILE OR IT MAY CORRUPT YOUR DEVICE
    if(OAK_SYSTEM_ROM_4F616B == 82 && deviceConfig->system_version < OAK_SYSTEM_VERSION){
      //this is a new system rom that we just booted into
      deviceConfig->system_version = OAK_SYSTEM_VERSION;
      memcpy(deviceConfig->version_string,OAK_SYSTEM_VERSION_STRING,sizeof(OAK_SYSTEM_VERSION_STRING));
      bootConfig->config_rom = bootConfig->current_rom;
      writeDeviceConfig();
      writeBootConfig();
      //go back to the user application
      rebootToUser();
    }
    else if(OAK_SYSTEM_ROM_4F616B != 82){
      //this is a new user rom, we have booted so set user rom to this
      if(bootConfig->program_rom != bootConfig->current_rom){ //if not already set
        bootConfig->program_rom = bootConfig->current_rom;
        writeBootConfig();
      }
    }
  #endif
}

//this should be called when the Particle library is inited 
void spark_initConfig(){
  if(spark_initialized)
    return;
  spark_initialized = true;
  Serial.println("INIT CONFIG");
  readDeviceConfig(); //will not return if valid device config does not exist, will reboot to config ROM - stubbed out for now
  readBootConfig();
  hex_decode(device_id,12,deviceConfig->device_id);
  oak_rom_init();
  spark_subscribe("spark", SystemEvents, NULL, ALL_DEVICES, NULL, NULL);
  spark_subscribe("oak", SystemEvents, NULL, MY_DEVICES, NULL, NULL);
}

bool spark_internal_connect(){
  if(!spark_initialized)
    spark_initConfig();
  if(!wifiConnected()){
    if(!wifiConnect()){
      Serial.println("WIFI");
      return false;
    }
    if(!wifiWaitForConnection()){
      Serial.println("WAIT");
      return false;
    }
  }
  if(!pClient.connected()){
    if(!particleConnect()){
      Serial.println("Particle");
      return false;
    }
    if(!particle_handshake()){
      Serial.println("SHAKE");
      return false;
    }

  }
  return true;
} 

uint8_t spark_failed_connects = 0;
uint32_t spark_last_failed_connect = 0;

bool spark_connect(){
  //connect with automatic back off
  //
  if(spark_failed_connects < 2 || 
    (spark_failed_connects < 5 && millis()-spark_last_failed_connect > 5000) || 
    millis()-spark_last_failed_connect > 30000 ){
    if(!spark_internal_connect()){
      spark_failed_connects++;
      spark_last_failed_connect = millis();
      return false;
    }
    else{
      spark_failed_connects = 0;
      return true;
    }
  }
  return false;
}

/*
void spark_send_tx(){
  if(spark_transmit_buffer_tail == spark_transmit_buffer_head)
    return;
  uint8_t buffer_length = (spark_transmit_buffer_tail + MAX_BUFF - spark_transmit_buffer_head) % MAX_BUFF;
  char buff[buffer_length];

  for(uint8_t b;b<buffer_length;b++){
    // Read from "head"
    buff[b] = spark_transmit_buffer[spark_transmit_buffer_head]; // grab next byte
    spark_transmit_buffer_head = (spark_transmit_buffer_head + 1) % MAX_BUFF;
  }

  //Particle.publish("oak/device/stdout", buff, 60, PRIVATE); 
  spark_send_event("oak/device/stdout", buff, 60, PRIVATE, NULL); 
}
*/


void spark_process()
{
  yield();
    if(spark_connected()){
      //spark_send_tx();
      if(!event_loop()){
        spark_disconnect();
        ERROR("EVENT LOOP FAIL!");
        return;
      }
    }
    else{
      spark_connect();
    }
    lastCloudEvent = millis();
}



